self/case2/40000_curved/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          75;
        startFace       11100;
    }
    outlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          75;
        startFace       11175;
    }
    fixedWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          150;
        startFace       11250;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          11250;
        startFace       11400;
    }
)

// ************************************************************************* //
